src/Documents/ПогашениеОплатыЗаОбучение/ПогашениеОплатыЗаОбучение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПогашениеОплатыЗаОбучение</name>
  <registerRecords>AccumulationRegister.ОстаткиНачисленийСтудентов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПениСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачисленнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиНачисленийСтудентов/ОстаткиНачисленийСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНачисленийСтудентов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/РегистрОпераций/РегистрОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрОпераций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТипОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПогашениеОплатыЗаОбучение/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиНачисленийСтудентов
	Движения.ОстаткиНачисленийСтудентов.Записывать = Истина;
	Движение = Движения.ОстаткиНачисленийСтудентов.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Студент = Студент;
	Движение.Сумма = ЗачисленнаяСумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	ЗаписьОперации = РегистрыСведений.РегистрОпераций.СоздатьМенеджерЗаписи();
	ЗаписьОперации.Период = Дата;
	ЗаписьОперации.ТипОперации = "Погашение оплаты";
	ЗаписьОперации.Студент = Студент;
	ЗаписьОперации.Сумма = ЗачисленнаяСумма;
	ЗаписьОперации.Записать();
КонецПроцедуры
